 
 gcc -g p10final.c
 ./a.out
Enter The Real Part
exit 
Enter The Imaginary PartEnter The Real PartEnter The Imaginary Part -0.0 + 0.0i and -0.0 + 0.0i is -0.0 + 0.0i 
 gcc -g p10final.c
 ./a.out
Enter The Real Part
2
Enter The Imaginary Part 
4
Enter The Real Part5
Enter The Imaginary Part7
 2.0 + 4.0i and 5.0 + 7.0i is 7.0 + 11.0i 
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x856: file p10final.c, line 33.
(gdb) r
Starting program: /home/runner/pps-test1-Ajayv122-17/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p10final.c:33
33    c1 = input();
(gdb) s
input () at p10final.c:10
10  {
(gdb) n
12    printf("Enter The Real Part");
(gdb) n
13    scanf("%f",&c.real);
(gdb) n
Enter The Real Part
2
14    printf("Enter The Imaginary Part");
(gdb) 
15    scanf("%f",&c.imaginary);
(gdb) n
Enter The Imaginary Part
5
16    return c;
(gdb) c
Continuing.
Enter The Real Part 6
Enter The Imaginary Part 8 
 2.0 + 5.0i and 6.0 + 8.0i is 8.0 + 13.0i[Inferior 1 (process 504) exited normally]
(gdb) 
